# Flow Convergence Characteristic Enumeration

Source: https://www.revitapidocs.com/2026/d61ae654-dcc6-74a4-dcab-033ea60eb6a1.htm

---

| Flow Convergence Characteristic Enumeration |
| --- |

The flow convergence characteristic of the analytical segment cluster.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public enum FlowConvergenceCharacteristic
```

```
Public Enumeration FlowConvergenceCharacteristic
```

```
public enum class FlowConvergenceCharacteristic
```

```
type FlowConvergenceCharacteristic
```
Members

| Member name | Value | Description |
| --- | --- | --- |
| Converge | 1 | Multile flow paths are converged into one segment. |
| Diverge | 2 | The flow is diverged from one segment into multiple paths. |
| Undefined | 0 | The flow convergence characteristic is undefined. |

See Also

#### Reference

Autodesk.Revit.DB.Analysis Namespace